[M_IrisEp1_HighwayToHell MissionDefinition]
MissionName="Road to Hell"
MissionDescription="Sir. Tig called. [place]Many people[-place], You're here to fight Pandora's biggest villains (we promise it's real this time) for the right to unlock a chest full of items.).<br> <br>But before you start, you must sign the Torgue Legal Agreement."
TurnInDescription="Look around and find someone who can support you. You can now start the game!"
MissionSummary="Sign a legal contract immediately.."
MissionGiver=""
MissionTurnInLocation="piston"
TeaserText=""

[M_IrisEp1_HighwayToHell:DefeatBandits MissionObjectiveDefinition]
ProgressMessage="Kill Llama Pete"

[M_IrisEp1_HighwayToHell:DefeatWave2 MissionObjectiveDefinition]
ProgressMessage="His mother's children were killed"

[M_IrisEp1_HighwayToHell:DefeatWave3 MissionObjectiveDefinition]
ProgressMessage="Kill Dirgo's enemies"

[M_IrisEp1_HighwayToHell:FindAWayIntoTheTournament MissionObjectiveDefinition]
ProgressMessage="Before"

[M_IrisEp1_HighwayToHell:FindSponsor MissionObjectiveDefinition]
ProgressMessage="Find sponsors in your area."

[M_IrisEp1_HighwayToHell:GoFindPiston MissionObjectiveDefinition]
ProgressMessage="Find the piston"

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Take out the enemy from there.."
MissionDescriptionOverride="Torge called you [place]Valley of the Devil[-place], Here you will face the worst villains of Pandora and the chance to unlock dungeons full of loot. (it's true)).<br> <br>Now you are in the field. Now you have to defeat some enemies outside.."

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Find a sponsor.."
MissionDescriptionOverride="I will hurt you teacher. [place]Another toast from Badassitude[-place], Find Pandora's biggest villains here and unlock a room full of loot (this time it's real, we promise)).<br> <br>However, you must be competitive in the field. Piston Gladiator no. 1 in the market is here to help you. He said you know."

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride="- at Torg Arena."
MissionDescriptionOverride="You are invited. girl [place]Tadro Heavy Crater[-place], And here you are. You have to earn a big bad Pandora (and we promise it's real this time) to earn the right to unlock a hall full of loot.).<br> <br>You must enter the arena to participate in the competition.."

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_HighwayToHell:ReachSignIn MissionObjectiveDefinition]
ProgressMessage="Register for the contest"

[M_IrisEp1_WTTJ MissionDefinition]
MissionName="probably in the woods"
MissionDescription="Welcome to Torge Arena! Now that you have a weightlifter (a muscular and angry piston), it's time to sign up for your first appointment. Chaos asks you to go to the battle table and register.."
TurnInDescription="The book is ready, now we separate the heads."
MissionSummary="Register your first tournament in the battle table."
MissionGiver="reduce"
MissionTurnInLocation="conflict"
TeaserText=""

[M_IrisEp1_WTTJ:EnterTheArena MissionObjectiveDefinition]
ProgressMessage="Enter the website"

[M_IrisEp1_WTTJ:FindGunChest MissionObjectiveDefinition]
ProgressMessage="Use the battle board in the arena"

[M_IrisEp1_WTTJ:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_WTTJ:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp1_WTTJ:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

